In [1]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

In [13]:
import pandas as pd

In [14]:
store_items = pd.DataFrame(items2, index = ['store1', 'store2', 'store3'])

In [15]:
store_items

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20      NaN     30    15.0      8   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     NaN     10    NaN       35

In [16]:
x = store_items.isnull().sum().sum()

In [17]:
x

3

In [18]:
store_items.isnull()

        bikes  glasses  pants  shirts  shoes  suits  watches
store1  False     True  False   False  False  False    False
store2  False    False  False   False  False  False    False
store3  False    False  False    True  False   True    False

In [19]:
store_items.isnull().sum()

bikes      0
glasses    1
pants      0
shirts     1
shoes      0
suits      1
watches    0
dtype: int64

In [30]:
store_items.count()

bikes      3
glasses    2
pants      3
shirts     2
shoes      3
suits      2
watches    3
dtype: int64

In [34]:
store_items

"""
我们将学习如何从 DataFrame 中删除包含任何 NaN 值的行或列。
如果 axis = 0，.dropna(axis) 方法将删除包含 NaN 值的任何行，
如果 axis = 1，.dropna(axis) 方法将删除包含 NaN 值的任何列。


.dropna() 方法不在原地地删除具有 NaN 值的行或列。
也就是说，原始 DataFrame 不会改变。你始终可以在 dropna() 方法中将关键字 inplace 设为 True，在原地删除目标行或列。
"""

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20      NaN     30    15.0      8   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     NaN     10    NaN       35

In [35]:
store_items.dropna(axis = 0)

        bikes  glasses  pants  shirts  shoes  suits  watches
store2     15     50.0      5     2.0      5    7.0       10

In [36]:
store_items.dropna(axis = 1)

        bikes  pants  shoes  watches
store1     20     30      8       35
store2     15      5      5       10
store3     20     30     10       35

In [37]:
store_items

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20      NaN     30    15.0      8   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     NaN     10    NaN       35

In [38]:
store_items.fillna(0)

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20      0.0     30    15.0      8   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     0.0     10    0.0       35

In [39]:
store_items

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20      NaN     30    15.0      8   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     NaN     10    NaN       35

In [40]:
store_items.fillna(method = 'ffill', axis = 0)

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20      NaN     30    15.0      8   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     2.0     10    7.0       35

In [41]:
store_items.fillna(method = 'ffill', axis = 1)
#上个行值进行前向填充

        bikes  glasses  pants  shirts  shoes  suits  watches
store1   20.0     20.0   30.0    15.0    8.0   45.0     35.0
store2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store3   20.0      4.0   30.0    30.0   10.0   10.0     35.0

In [42]:
store_items

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20      NaN     30    15.0      8   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     NaN     10    NaN       35

In [43]:
store_items.fillna(method='backfill', axis = 0)

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20     50.0     30    15.0      8   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     NaN     10    NaN       35

In [44]:
store_items.fillna(method='backfill', axis = 1)

        bikes  glasses  pants  shirts  shoes  suits  watches
store1   20.0     30.0   30.0    15.0    8.0   45.0     35.0
store2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store3   20.0      4.0   30.0    10.0   10.0   35.0     35.0

In [45]:
store_items.interpolate(method='linear', axis = 0)

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20      NaN     30    15.0      8   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     2.0     10    7.0       35

In [46]:
import pandas as pd
import numpy as np

In [47]:
pd.set_option('precision', 1)

In [48]:
books = pd.Series(data =  ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])

In [49]:
books

0     Great Expectations
1        Of Mice and Men
2       Romeo and Juliet
3       The Time Machine
4    Alice in Wonderland
dtype: object

In [50]:
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

In [51]:
authors

0        Charles Dickens
1         John Steinbeck
2    William Shakespeare
3            H. G. Wells
4          Lewis Carroll
dtype: object

In [53]:
user_1 = pd.Series(data = [3.2, np.nan, 2.5 ])

In [54]:
user_1

0    3.2
1    NaN
2    2.5
dtype: float64

In [55]:
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])

In [56]:
user_2

0    5.0
1    1.3
2    4.0
3    3.8
dtype: float64

In [57]:
type(user_2)

pandas.core.series.Series

In [62]:
dat = {'Book Title' : books,
       'Author' : authors,
       'User 1' : user_1,
       'User 2' : user_2,
       'User 3' : user_3,
       'User 4' : user_4}

In [63]:
dat

{'Book Title': 0     Great Expectations
 1        Of Mice and Men
 2       Romeo and Juliet
 3       The Time Machine
 4    Alice in Wonderland
 dtype: object, 'Author': 0        Charles Dickens
 1         John Steinbeck
 2    William Shakespeare
 3            H. G. Wells
 4          Lewis Carroll
 dtype: object, 'User 1': 0    3.2
 1    NaN
 2    2.5
 dtype: float64, 'User 2': 0    5.0
 1    1.3
 2    4.0
 3    3.8
 dtype: float64, 'User 3': 0    2.0
 1    2.3
 2    NaN
 3    4.0
 dtype: float64, 'User 4': 0    4.0
 1    3.5
 2    4.0
 3    5.0
 4    4.2
 dtype: float64}

In [64]:
type(dat)

dict

In [65]:
book_ratings = pd.DataFrame(dat)

In [67]:
book_ratings

            Book Title               Author  User 1  User 2  User 3  User 4
0   Great Expectations      Charles Dickens     3.2     5.0     2.0     4.0
1      Of Mice and Men       John Steinbeck     NaN     1.3     2.3     3.5
2     Romeo and Juliet  William Shakespeare     2.5     4.0     NaN     4.0
3     The Time Machine          H. G. Wells     NaN     3.8     4.0     5.0
4  Alice in Wonderland        Lewis Carroll     NaN     NaN     NaN     4.2

In [69]:
book_ratings.fillna(method = 'ffill', axis = 0)

            Book Title               Author  User 1  User 2  User 3  User 4
0   Great Expectations      Charles Dickens     3.2     5.0     2.0     4.0
1      Of Mice and Men       John Steinbeck     3.2     1.3     2.3     3.5
2     Romeo and Juliet  William Shakespeare     2.5     4.0     2.3     4.0
3     The Time Machine          H. G. Wells     2.5     3.8     4.0     5.0
4  Alice in Wonderland        Lewis Carroll     2.5     3.8     4.0     4.2

In [74]:
book_ratings.fillna(book_ratings.mean(), inplace = True)

In [75]:
book_ratings

            Book Title               Author  User 1  User 2  User 3  User 4
0   Great Expectations      Charles Dickens     3.2     5.0     2.0     4.0
1      Of Mice and Men       John Steinbeck     2.9     1.3     2.3     3.5
2     Romeo and Juliet  William Shakespeare     2.5     4.0     2.8     4.0
3     The Time Machine          H. G. Wells     2.9     3.8     4.0     5.0
4  Alice in Wonderland        Lewis Carroll     2.9     3.5     2.8     4.2

In [76]:


best_rated = book_ratings[(book_ratings == 5).any(axis = 1)]['Book Title'].values

In [77]:
best_rated

array(['Great Expectations', 'The Time Machine'], dtype=object)

In [83]:
book_ratings[(book_ratings == 5).any(axis = 1)]['Book Title'].values

array(['Great Expectations', 'The Time Machine'], dtype=object)

In [85]:
#将数据加载到 Pandas DataFrame

In [86]:
dates = pd.date_range('2000-01-01', '2016-12-31')

In [87]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08',
               '2000-01-09', '2000-01-10',
               ...
               '2016-12-22', '2016-12-23', '2016-12-24', '2016-12-25',
               '2016-12-26', '2016-12-27', '2016-12-28', '2016-12-29',
               '2016-12-30', '2016-12-31'],
              dtype='datetime64[ns]', length=6210, freq='D')

In [88]:
type(dates)

pandas.core.indexes.datetimes.DatetimeIndex

In [89]:
all_stocks = pd.DataFrame(index = dates)

In [91]:
type(all_stocks)

pandas.core.frame.DataFrame